[
    {
        "company": "AFEX",
        "title": "Frontend Developer",
        "type": "Full-time",
        "location": "Hybrid",
        "duration": "Jan 2021 - Present",
        "logo": "https://media.licdn.com/dms/image/v2/C4E0BAQGUXraIhl0u8w/company-logo_100_100/company-logo_100_100/0/1630644778319/afex_commodities_exchange_logo?e=1758153600&v=beta&t=fLbQ0nqZAD9BFz-33bC3EeJsQXv2T5Kl4ZLV6SdL3Hg",
        "description": "Developed and maintained responsive, secure frontend components for Africa Exchange’s flagship trading platform by translating Figma designs and integrating backend APIs. Collaborated closely with designers, product managers, and backend engineers to deliver scalable, intuitive user experiences. Led performance optimizations, refactored legacy code to meet evolving business needs, and ensured adherence to Agile processes while implementing security best practices against common web vulnerabilities.",
        "skills": [
            "Next.js",
            "TypeScript",
            "Bitbucket",
            "Vitest"
        ]
    },
    {
        "company": "Helpa",
        "title": "Frontend Engineer",
        "type": "Contract",
        "location": "Remote",
        "duration": "Aug 2022 - Nov 2022, Apr 2024 - Dec 2024",
        "logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFzwYyUSOmaoA/company-logo_100_100/company-logo_100_100/0/1674620522771?e=1758153600&v=beta&t=43VNUUtebxHmqSZmIitzo1Q6KxpCxMwit7655FCkG5A",
        "description": "Partnered with a backend engineer, product designer, and management team to deliver two feature-rich versions of the company’s user and admin healthcare platforms. Designed and implemented distinct workflows for four unique user types, ensuring personalized and efficient user experiences. Built a modular web page setup tool for NGO users, enabling theme customization and feature configuration. Enhanced platform SEO to improve search rankings and organic reach. Developed a secure, multi-currency donation flow with integrations to multiple global payment gateways. Implemented a flexible authentication and role-based access control system using Next.js middleware, complete with activity tracking for better security and user management.",
        "skills": [
            "Next.js",
            "Mantine UI",
            "TypeScript",
            "Tailwind CSS"
        ]
    },
    {
        "company": "Volomn",
        "title": "Frontend Developer",
        "type": "Contract",
        "location": "Remote",
        "duration": "Aug 2022 - Nov 2022, Apr 2024 - Dec 2024",
        "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQELxqODs5LNqw/company-logo_100_100/company-logo_100_100/0/1661581875089?e=1758153600&v=beta&t=War4geEBO7WqTgTIaFyCVj5sOCZ5OzAOEZYGv7b-MFw",
        "description": "Revamped and restructured the homepage architecture, improving visual appeal, usability, and load performance. Integrated Strapi CMS to seamlessly fetch and render dynamic blog content, optimizing the blogs page for scalability and streamlined content management. Built the “For Talents” page from detailed Figma designs, delivering a pixel-perfect, fully responsive layout that maintained design consistency across all devices.",
        "skills": [
            "Next.js",
            "Tailwind CSS",
            "Strapi"
        ]
    }
]